<template><div><h1 id="سوالات-متداول" tabindex="-1"><a class="header-anchor" href="#سوالات-متداول" aria-hidden="true">#</a> سوالات متداول</h1>
<p>در اینجا لیستی از سوالات متداول پاسخ داده شده است که ممکن است سوال شما هم باشد. درصورتی که سوال دیگری دارید میتوانید در تلگرام یا واتس اپ به شماره 09369628740 پیام دهید.</p>
<h3 id="چرا-اپ-ادیتور-تحت-وب-است؟" tabindex="-1"><a class="header-anchor" href="#چرا-اپ-ادیتور-تحت-وب-است؟" aria-hidden="true">#</a> چرا اپ ادیتور تحت وب است؟</h3>
<p>چون اپ ادیتور تحت وب است</p>
<h3 id="اپ-native-چیست-و-آیا-اپ-ادیتور-خروجی-native-می-دهد؟" tabindex="-1"><a class="header-anchor" href="#اپ-native-چیست-و-آیا-اپ-ادیتور-خروجی-native-می-دهد؟" aria-hidden="true">#</a> اپ NATIVE چیست و آیا اپ ادیتور خروجی NATIVE می دهد؟</h3>
<p>Native در لغت به معنای بومی است و به برنامه هایی Native گفته می شود که برنامه نویسی آن توسط زبان اصلی سیستم عامل نوشته شده باشد. مثلاً زبان اصلی سیستم عامل اندروید جاوا است.
اپلیکیشن هایی که بصورت Native برنامه نویسی می شوند از کیفیت بالاتر، سرعت بالاتر و اجرای روانتری برخوردار هستند. برنامه ساز و سورس ساز اپ ادیتور بصورت صد درصد اپ و سورس Native تولید می کند.</p>
<h3 id="اپ-هایی-که-توسط-اپ-ادیتور-ساخته-می-شوند-در-مارکت-ها-اجازه-انتشار-خواهند-داشت؟" tabindex="-1"><a class="header-anchor" href="#اپ-هایی-که-توسط-اپ-ادیتور-ساخته-می-شوند-در-مارکت-ها-اجازه-انتشار-خواهند-داشت؟" aria-hidden="true">#</a> اپ هایی که توسط اپ ادیتور ساخته می شوند در مارکت ها اجازه انتشار خواهند داشت؟</h3>
<p>بله!
با توجه به Native بودن و باکیفیت بودن اپ های تولید شده توسط AppEditor، مارکت ها اشکال نمی گیرند و اجازه انتشار می دهند مگر اینکه در محتوای اپ ساخته شده مشکلی مشاهده شود.</p>
<h3 id="برنامه-ساز-اپ-ادیتور-آنلاین-است-یا-دسکتاپی؟" tabindex="-1"><a class="header-anchor" href="#برنامه-ساز-اپ-ادیتور-آنلاین-است-یا-دسکتاپی؟" aria-hidden="true">#</a> برنامه ساز اپ ادیتور آنلاین است یا دسکتاپی؟</h3>
<p>اپ ادیتور از یک پنل بسیار قدرتمند آنلاین بهره می برد که کارکردن با آن بسیار راحت و کاربر پسند است. از جمله مزایای آنلان بودن اپ ادیتور می توان به موارد زیر اشاره کرد:</p>
<ul>
<li>عدم نیاز به دانلود و نصب نرم افزار</li>
<li>عدم نیاز به نصب یا فعال سازی افزونه</li>
<li>دریافت کمک از پشتیبان اپ ادیتور برای طراحی یا تکمیل اپ خاص</li>
<li>عدم نیاز به آپدیت نرم افزار</li>
<li>عدم وابسته بودن به سیستم عامل</li>
<li>امکان استفاده از بیش از 600 هزار آیکون آماده بصورت آنلاین</li>
</ul>
</div></template>


