<template><div><h1 id="معرفی-اپ-ادیتور" tabindex="-1"><a class="header-anchor" href="#معرفی-اپ-ادیتور" aria-hidden="true">#</a> معرفی اپ ادیتور</h1>
<p>اپ ادیتور یک <a href="https://appeditor.ir" target="_blank" rel="noopener noreferrer">اپلیکیشن ساز آنلاین<ExternalLinkIcon/></a> و قدرتمند است که به کمک آن می توان خیلی سریع یک اپلیکیشن زیبا و باکیفیت طراحی کرد.
برای ساخت اپ در این برنامه ساز نیازی به برنامه نویسی نیست و کار کردن با آن آسان است.</p>
<p>برای شروع کافیست با یک مرورگر وارد
<a href="https://panel.appeditor.ir" target="_blank" rel="noopener noreferrer">پنل ساخت اپ<ExternalLinkIcon/></a>
شوید و برنامه مورد نظر خود را بسازید.</p>
<p>شاید از خود بپرسید بهترین اپلیکیشن ساز آنلاین چه ویژگی‌هایی باید داشته باشد یا اینکه چطور میتوان به صورت رایگان یک اپلیکیشن ساخت یا آیا بدون دانش برنامه نویسی ساخت اپلیکیشن امکان پذیر است و سوالات دیگر. با مطالعه این راهنما جواب تمام سوالات خود را پیدا خواهید کرد.</p>
<h3 id="ساخت-رایگان-اپلیکیشن" tabindex="-1"><a class="header-anchor" href="#ساخت-رایگان-اپلیکیشن" aria-hidden="true">#</a> ساخت رایگان اپلیکیشن</h3>
<p>در اپ ادیتور، شما می‌توانید به صورت رایگان اپلیکیشن‌های خود را بسازید. اپلیکیشن‌های ساخته شده به صورت رایگان و برای مدت <strong>نامحدود</strong> قابل استفاده هستند و هرگز غیرفعال نخواهند شد مگر اینکه از سرویس‌های پولی داخل اپ استفاده شده باشد. در این صورت برای استفاده از آن سرویس، ممکن است نیاز به پرداخت هزینه‌ای داشته باشید. با این حال، سایر بخش‌های اپلیکیشن که از سرویس استفاده نمی‌کنند، همچنان به صورت فعال باقی خواهند ماند. در اپلیکیشن‌های رایگان، تبلیغات ممکن است نمایش داده شود، اما تبلیغات به گونه‌ای طراحی شده‌اند که برای کاربران نهایی اپلیکیشن، خسته‌کننده و آزاردهنده نباشند.</p>
<h3 id="امکانات-اپ-ادیتور" tabindex="-1"><a class="header-anchor" href="#امکانات-اپ-ادیتور" aria-hidden="true">#</a> امکانات اپ ادیتور</h3>
<p>اپ ادیتور از زمان راه‌اندازی در سال 97 به طور پیوسته در حال رشد و توسعه بوده و تاکنون امکانات زیادی به این پلتفرم برنامه ساز اضافه شده است و با توجه به استقبال زیاد کاربران و رضایت حداکثری آنها این انگیزه را برای تیم اپ ادیتور ایجاد کرده تا با تلاش مضاعف بتوانند <a href="https://appeditor.ir" target="_blank" rel="noopener noreferrer">بهترین اپلیکیشن ساز آنلاین<ExternalLinkIcon/></a> را برای شما به ارمغان بیاورند.</p>
<p>برخی از امکانات اپ ادیتور شامل موارد زیر است:</p>
<ul>
<li><RouterLink to="/application-design/page-design.html">صفحه ساز قدرتمند</RouterLink></li>
<li><RouterLink to="/application-design/animation.html">امکان ایجاد انیمیشن برای اجزای صفحه</RouterLink></li>
<li><RouterLink to="/application-design/icons.html">بانک آیکون با قابلیت تغییر رنگ</RouterLink></li>
<li><RouterLink to="/application-design/templates.html">قالب‌های متنوع و قابلیت شخصی‌سازی</RouterLink></li>
<li><RouterLink to="/make-application/source-code.html">امکان دریافت سورس‌کد اپلیکیشن</RouterLink></li>
<li><RouterLink to="/services/form-builder.html">امکان ساخت فرم‌های ثبت اطلاعات</RouterLink></li>
<li><RouterLink to="/application-design/widgets/video.html">امکان پخش ویدئو</RouterLink></li>
<li><RouterLink to="/application-design/widgets/audio.html">امکان پخش صوت</RouterLink></li>
<li><RouterLink to="/application-design/widgets/pdf.html">امکان نمایش فایل pdf</RouterLink></li>
<li><RouterLink to="/application-design/widgets/webview.html">امکان نمایش وبسایت داخل اپ(وب‌ویو)</RouterLink></li>
<li><RouterLink to="/application-design/widgets/rss-reader.html">امکان درج خبرخوان(RSS Reader)</RouterLink></li>
<li><a href="/application-design/actions">اجرای عملکردهای متنوع</a></li>
<li><a href="/application-design/conditions">قابلیت اعمال انواع شرط ها</a></li>
<li><a href="/application-design/variables">قابلیت متغیرها</a></li>
<li><RouterLink to="/services/account.html">امکان عضویت و حساب کاربری</RouterLink></li>
<li><RouterLink to="/services/shop-maker.html">امکان ساخت فروشگاه</RouterLink></li>
<li><RouterLink to="/services/online-content-update.html">امکان انتشار آنلاین محتوا بدون نیاز به نصب مجدد</RouterLink></li>
<li><RouterLink to="/services/ads.html">امکان کسب درآمد با نمایش تبلیغات</RouterLink></li>
<li><RouterLink to="/services/in-app-purchase.html">امکان خرید و پرداخت درون‌برنامه‌ای</RouterLink></li>
<li><RouterLink to="/services/notification.html">امکان ارسال پیام به کاربران(ارسال اعلان یا نوتیفیکیشن)</RouterLink></li>
<li><RouterLink to="/services/wordpress.html">امکان اتصال به وردپرس</RouterLink></li>
<li><RouterLink to="/services/woocommerce.html">امکان اتصال به ووکامرس(به زودی)</RouterLink></li>
<li><RouterLink to="/make-application/output.html">امکان دریافت خروجی اندروید</RouterLink></li>
<li><a href="#">امکان دریافت خروجی ios (به زودی)</a></li>
<li><a href="#">امکان دریافت خروجی ویندوز (به زودی)</a></li>
<li><a href="#">امکان دریافت خروجی وب (به زودی)</a></li>
<li><RouterLink to="/make-application/output.html">تولید خروجی نیتیو</RouterLink></li>
</ul>
<h3 id="چه-برنامه-هایی-قابل-ساخت-است؟" tabindex="-1"><a class="header-anchor" href="#چه-برنامه-هایی-قابل-ساخت-است؟" aria-hidden="true">#</a> چه برنامه هایی قابل ساخت است؟</h3>
<p>با استفاده از برنامه‌ساز اپ ادیتور و با توجه به قابلیت‌های ذکر شده در بالا اپلیکیشن‌های متنوع زیادی می توان ساخت که از جمله به موارد زیر اشاره می‌کنیم:</p>
<ul>
<li>ساخت اپلیکیشن‌های آموزشی</li>
<li>ساخت اپلیکیشن های خبری یا اطلاع رسانی</li>
<li>ساخت انواع فروشگاه</li>
<li>ساخت انواع کتاب، مرجع و رُمان</li>
<li>ساخت گالری تصویر</li>
<li>ساخت اپلیکیشن‌های صوتی و تصویری</li>
<li>ساخت فرم های دریافت اطلاعات و یا ثبت سفارش</li>
<li>ساخت اپلیکیشن برای مدارس</li>
<li>ساخت اپلیکیشن معرفی خدمات و کسب و کار</li>
<li>ساخت اپلیکیشن داستان کودکان</li>
<li>ساخت اپلیکیشن تعاملی و آموزشی برای کودکان</li>
<li>ساخت اپلیکیشن آشپزی و دستور پخت</li>
<li>اپلیکیشن راهنمای سفر و مکان‌های دیدنی</li>
<li>ساخت اپلیکیشن جعبه لایتنر</li>
<li>ساخت پایان‌نامه</li>
<li>ساخت رزومه</li>
<li>ساخت اپلیکیشن معرفی و کاتالوگ محصولات</li>
<li>ساخت منوی رستوران‌ها و سفارش غذا</li>
<li>و...</li>
</ul>
<p>شما چه ایده‌ای برای ساخت اپ به ذهنتون میرسه؟</p>
<h3 id="برای-ساخت-اپ-به-چه-چیزهایی-نیاز-است؟" tabindex="-1"><a class="header-anchor" href="#برای-ساخت-اپ-به-چه-چیزهایی-نیاز-است؟" aria-hidden="true">#</a> برای ساخت اپ به چه چیزهایی نیاز است؟</h3>
<p>برای ساخت اپلیکیشن توسط برنامه ساز اپ ادیتور به یک کامپیوتر و یک مرورگر نیاز است. البته از طریق مرورگر گوشی هم میتوان وارد پنل اپ ادیتور شد و اپ ساخت ولی به دلیل فضای محدود صفحه نمایش گوشی، کارکردن با آن کمی سخت است.
تیم اپ ادیتور در نظر دارد در آینده نسخه هایی از پنل را ارائه کند که مناسب موبایل یا ویندوز است تا به راحتی بتوان در این پلتفرم ها هم اپ ساخت یا اپ های ساخته شده را مدیریت کرد.</p>
<h3 id="دریافت-خروجی-باکیفیت" tabindex="-1"><a class="header-anchor" href="#دریافت-خروجی-باکیفیت" aria-hidden="true">#</a> دریافت خروجی باکیفیت</h3>
<p>خروجی تولید شده توسط برنامه ساز اپ ادیتور یک خروجی باکیفیت و از نوع native است. اپلیکیشن‌هایی که native هستند اجرای روان‌تر و بهینه‌تری دارند اما اپلیکیشن‌هایی که صرفا کدهای html را نشان می دهند روان نیستند و اجرای کند و همراه با لَگ دارند.</p>
<p>درحال حاضر خروجی تولید شده توسط برنامه ساز اپ ادیتور مناسب سیستم عامل اندروید است و دو نوع فایل apk و aab قابل دریافت است. فایل apk همان نسخه نصبی اپلیکیشن روی گوشی های اندرویدی است و فایل aab نسخه
<a href="https://developer.android.com/platform/technology/app-bundle" target="_blank" rel="noopener noreferrer">اپ‌باندل(App Bundle)<ExternalLinkIcon/></a>
اپلیکیشن است. نسخه اپ باندل برای انتشار در پلی استور گوگل مناسب است و مزیت آن این است که موقع دانلود اپ توسط کاربران نسخه‌ای از اپ به کاربر ارائه میشود که مناسب و بهینه شده برای گوشی کاربر است و حجم کمتری دارد. همچنین موقع نصب حجم کمتری روی گوشی کاربر اشغال می شود.</p>
<p>تیم اپ ادیتور سعی دارد در آینده امکان ایجاد خروجی برای سایر سیستم‌عامل‌ها از جمله ios و ویندوز فراهم کند.</p>
<p>برای اطلاعات بیشتر و آموزش نحوه‌ی دریافت خروجی به بخش
<RouterLink to="/make-application/output.html">دریافت خروجی اپلیکیشن</RouterLink>
مراجعه نمایید</p>
<h3 id="دریافت-سورس‌کد-اپلیکیشن" tabindex="-1"><a class="header-anchor" href="#دریافت-سورس‌کد-اپلیکیشن" aria-hidden="true">#</a> دریافت سورس‌کد اپلیکیشن</h3>
<p>یکی از قابلیت‌های متمایز و مهم برنامه ساز اپ ادیتور امکان دریافت سورس‌کد اپلیکیشن ساخته شده است. سورس ایجاد شده ویژه‌ی پلتفرم
<a href="https://flutter.dev" target="_blank" rel="noopener noreferrer">فلاتر<ExternalLinkIcon/></a>
است که توسط گوگل ایجاد شده و پشتیبانی می‌شود.</p>
<p>با استفاده از قابلیت دریافت سورس می‌توان موارد و امکانات خاص که در اپ ادیتور وجود ندارد را از طریق برنامه‌نویسی به اپ اضافه کرد.
همچنین این قابلیت به برنامه‌نویسان کمک می‌کند در پروژه‌هایشان بخش طراحی اپلیکیشن و کارهای گرافیکی را خیلی سریع و با کیفیت بالا انجام دهند و تمرکز اصلی خود را روی کدنویسی و پیاده‌سازی ایده مورد نظر صرف کنند.</p>
<hr>
<p>برای شروع ابتدا در پنل <a href="/get-started/register">عضو</a> شوید و <a href="/get-started/first-app">اولین اپلیکیشن خود را بسازید</a>.</p>
</div></template>


