<template><div><h1 id="نحوه-ثبت-نام-و-ورود-به-پنل" tabindex="-1"><a class="header-anchor" href="#نحوه-ثبت-نام-و-ورود-به-پنل" aria-hidden="true">#</a> نحوه ثبت نام و ورود به پنل</h1>
<p>برای استفاده از اپ ادیتور، ابتدا به آدرس زیر مراجعه کنید:</p>
<p><a href="https://panel.appeditor.ir" target="_blank" rel="noopener noreferrer">https://panel.appeditor.ir<ExternalLinkIcon/></a></p>
<p>این لینک، <a href="https://panel.appeditor.ir/" target="_blank" rel="noopener noreferrer">آدرس پنل ساخت آنلاین اپلیکیشن<ExternalLinkIcon/></a> است. برای ورود به پنل، باید قبلاً عضو شده باشید. برای عضویت، روی دکمه <strong>عضویت</strong> کلیک کنید و یک ایمیل و رمز عبور وارد کنید. سپس روی دکمه &quot;ایجاد حساب کاربری&quot; کلیک کنید.</p>
<p>بعد از کلیک، یک ایمیل حاوی لینک فعال‌سازی برای شما ارسال می‌شود. حتماً برای تأیید عضویت، روی لینک کلیک کنید. سپس به صفحه ورود منتقل می‌شوید و با ایمیل و کلمه عبوری که انتخاب کرده‌اید، می‌توانید وارد پنل شوید.</p>
<div class="hint-container warning">
<p class="hint-container-title">توجه</p>
<p>درصورتی که ایمیل را مشاهده نکردید ممکن است به صندوق spam یا bulk ایمیل شما رفته باشد. درصورتی که آنجا هم نبود یا به هر دلیل ایمیل را دریافت نکردید و موفق به ثبت نام نشدید از طریق بخش تماس با ما به ما اطلاع دهید تا همکاران ما شما را راهنمایی نمایند.</p>
</div>
<div class="hint-container tip">
<p class="hint-container-title">عضویت سریع</p>
<p>درصورتی که یک gmail فعال دارید و قبلا وارد gmail خود شده‌اید از طریق دکمه <strong>«ورود سریع با گوگل»</strong> می‌توانید وارد پنل شوید و عضویت شما به صورت خودکار انجام می شود. بعد از ورود به پنل می توانید کلمه عبور مناسب برای حساب خود انتخاب کنید و پروفایل خود را تکمیل نمایید</p>
</div>
</div></template>


