<template><div><h1 id="طراحی-صفحه" tabindex="-1"><a class="header-anchor" href="#طراحی-صفحه" aria-hidden="true">#</a> طراحی صفحه</h1>
<div style="text-align: center">
<img :src="$withBase('/page-design/page-design-area.jpg')" width="450" class="zoom">
</div>
<p>بخش طراحی صفحه یکی از بخش‌های قدرتمند <a href="https://appeditor.ir" target="_blank" rel="noopener noreferrer">اپلیکیشن ساز آنلاین<ExternalLinkIcon/></a> اپ ادیتور است.
به کمک این بخش می‌توان صفحات اپلیکیشن را طراحی کرد. اجزای صفحه به صورت درختی در این بخش نمایش داده می‌شوند.
هر صفحه از
<RouterLink to="/application-design/widgets/group.html">گروه‌ها</RouterLink> و <a href="widgets">ویجت‌ها</a> تشکیل شده است.
ویجت‌ها داخل گروه قرار می‌گیرند. یک گروه که خود نوعی ویجت است می‌تواند داخل یک گروه دیگر قرار گیرد.
این ویژگی انعطاف‌پذیری بالایی ایجاد کرده و خلق هر نوع صفحه‌ای را امکانپذیر می‌کند.</p>
<p>هر صفحه دارای یک <strong>گروه اصلی</strong> است. ابعاد گروه اصلی به اندازه ابعاد صفحه نمایش دستگاه است. ویجت‌ها و سایر گروه‌ها در این گروه قرار می‌گیرند.</p>
<p>هر گروه دارای چیدمان مشخصی است و ویجت‌های داخل گروه براساس چیدمان مشخص شده چیده می‌شوند. انواع چیدمان گروه به شرح زیر است:</p>
<ul>
<li>چیدمان عمودی</li>
<li>چیدمان افقی</li>
<li>چیدمان لایه‌ای</li>
<li>چیدمان جدولی</li>
</ul>
<p>در تصویر زیر انواع چیدمان گروه را می‌توانید مشاهده نمایید:</p>
<div style="text-align: center">
<img :src="$withBase('/page-design/group-layouts.jpg')" class="zoom" alt="چیدمان عمودی، افقی، لایه ای و جدولی" width="450">
</div>
<p>در بخش <RouterLink to="/application-design/widgets/group.html">گروه‌ها</RouterLink> توضیحات بیشتری در مورد چیدمان های مختلف ارائه شده است.</p>
<h2 id="ایجاد-صفحه" tabindex="-1"><a class="header-anchor" href="#ایجاد-صفحه" aria-hidden="true">#</a> ایجاد صفحه</h2>
<div style="text-align: center">
<img :src="$withBase('/page-design/new-page.jpg')" alt="" width="450" class="zoom">
</div>
<p>تصویر بالا بخش طراحی یک اپ خالی را نشان می دهد.
در قسمت راست، منوی اصلی قرار دارد که شامل لیست صفحات است و در قسمت چپ شبیه ساز است که تغییرات را بصورت آنی نمایش می دهد.
برای ایجاد صفحه جدید همانطور که در تصویر نمایش داده شده باید روی دکمه صفحه جدید کلیک کنیم.
بعد از کلیک یک پنجره کوچک باز می شود و لازم است عنوان صفحه را وارد کنیم.</p>
<div class="hint-container warning">
<p class="hint-container-title">توجه</p>
<p>در انتخاب عنوان صفحه دقت کنید. این عنوان در داخل اپلیکیشن در بخش جستجو نمایش داده می شود و بهتر است متناسب با محتوای آن صفحه باشد.</p>
</div>
<h2 id="انتخاب-قالب" tabindex="-1"><a class="header-anchor" href="#انتخاب-قالب" aria-hidden="true">#</a> انتخاب قالب</h2>
<p>در مرحله بعد می توانیم برای صفحه یک قالب انتخاب کنیم. لیستی از قالب های موجود به صورت دسته‌بندی شده نمایش داده می شود که می‌توانیم یکی از آنها را انتخاب کنیم.</p>
<div style="text-align: center">
<img :src="$withBase('/page-design/select-template.jpg')" alt="" width="450" class="zoom">
</div>
<p>با کلیک بر روی هر قالب، آن قالب در شبیه‌ساز نمایش داده می‌شود. انتخاب قالب اختیاری است و می‌توانیم با کلیک بر روی دکمه &quot;بدون قالب&quot; یک صفحه خالی ایجاد کنیم.</p>
<p>در تصویر زیر، بخش طراحی صفحه پس از انتخاب قالب نمایش داده شده است.</p>
<div style="text-align: center">
<img :src="$withBase('/page-design/page-designer-area.jpg')" alt="" width="450" class="zoom">
</div>
<p>همانطور که مشاهده می‌کنید، تمام جزئیات قالب انتخاب شده در شبیه‌ساز به صورت درختی نمایش داده شده و کاربران می‌توانند آن‌ها را ویرایش کنند.</p>
<h2 id="محیط-طراحی-اپلیکیشن" tabindex="-1"><a class="header-anchor" href="#محیط-طراحی-اپلیکیشن" aria-hidden="true">#</a> محیط طراحی اپلیکیشن</h2>
<div style="text-align: center">
<img :src="$withBase('/page-design/page-designer-anatomy.jpg')" class="zoom">
</div>
<p>محیط طراحی اپلیکیشن در اپ ادیتور شامل چند بخش اصلی است که هر کدام وظایف و مزایای خود را دارند. بخش اول لیست صفحات است که مجموعه ای از تمام صفحات موجود در اپلیکیشن را در اختیار کاربر قرار می دهد و امکاناتی از جمله مرتب سازی، ایجاد، ویرایش و حذف صفحات را فراهم می کند.</p>
<p>بخش دوم، لیست تمام ویجت های داخل صفحه نمایش داده می شود که به صورت درختی است. در این بخش ویجت ها را می توان اضافه کرد، ویرایش کرد، جابجا کرد و یا حتی حذف کرد.</p>
<p>بخش سوم شامل شبیه ساز است که طراحی اپ را به صورت زنده نمایش می دهد و تمام تغییرات به صورت آنی اعمال می شود.</p>
<p>به طور کلی، محیط طراحی اپلیکیشن در اپ ادیتور، به کاربران این امکان را می دهد که با استفاده از امکانات متنوع آن، به راحتی طراحی های خود را به دلخواه ایجاد کنند و با استفاده از شبیه ساز، آن ها را به طور دقیق بررسی کنند.</p>
<div class="hint-container tip">
<p class="hint-container-title">ترفند</p>
<p>در محیط طراحی با استفاده از دکمه های برگشت به جلو یا برگشت به عقب می توانید اشتباهات طراحی خود را اصلاح کنید و یا با طرح قبلی مقایسه کنید.
توجه کنید این دکمه ها تغییرات را به صورت موقت به عقب یا جلو بر میگردانند و با رفرش پنل سابقه طراحی قابل دسترسی نیست.</p>
</div>
<div class="hint-container tip">
<p class="hint-container-title">ترفند</p>
<p>با کشیدن و رها کردن ویجت ها در لیست می توانید آنها را در گروه جابجا کنید یا به گروه های دیگر منتقل کنید.</p>
</div>
<h3 id="آشنایی-با-صفحات-آغازین،-معرفی-و-اصلی" tabindex="-1"><a class="header-anchor" href="#آشنایی-با-صفحات-آغازین،-معرفی-و-اصلی" aria-hidden="true">#</a> آشنایی با صفحات آغازین، معرفی و اصلی</h3>
<h4 id="صفحه-آغازین-splash" tabindex="-1"><a class="header-anchor" href="#صفحه-آغازین-splash" aria-hidden="true">#</a> صفحه آغازین(splash)</h4>
<p>صفحه آغازین همان صفحه‌ای است که در ابتدای اجرای اپلیکیشن به نمایش در می‌آید و به طور معمول برای نمایش لوگو، نام برنامه و اطلاعات کوتاهی درباره برنامه استفاده می‌شود. به‌طور کلی صفحه‌ای است که هدف آن جلب توجه کاربر و ارائه اولین تجربه از اپلیکیشن به کاربران است. در تنظیمات اپلیکیشن می توانید مدت زمان مکث در این صفحه را بر حسب ثانیه تعیین کنید.</p>
<h4 id="صفحه-معرفی" tabindex="-1"><a class="header-anchor" href="#صفحه-معرفی" aria-hidden="true">#</a> صفحه معرفی</h4>
<p>صفحه معرفی یکی از صفحات اپلیکیشن است که معمولاً شامل معرفی کامل برنامه، قابلیت ها، ویژگی‌ها و اهداف آن می‌باشد. این صفحه بعد از نصب یا بروزرسانی برنامه <strong>فقط یکبار</strong> بعد از صفحه آغازین نمایش داده می‌شود.</p>
<h4 id="صفحه-اصلی" tabindex="-1"><a class="header-anchor" href="#صفحه-اصلی" aria-hidden="true">#</a> صفحه اصلی</h4>
<p>صفحه اصلی در اپلیکیشن، صفحه ای است که کاربر به صورت پیش‌فرض پس از ورود به برنامه با آن مواجه می‌شود. این صفحه معمولاً حاوی دکمه ها، اطلاعات و عملکردهای مربوط به برنامه است و برای دسترسی سریعتر به اجزای مختلف برنامه اهمیت بسیاری دارد. در اپلیکیشن‌های چند صفحه‌ای، کاربر با کلیک بر روی دکمه‌ها و یا منوهای موجود در این صفحه می‌تواند به صفحات دیگر دسترسی پیدا کند.</p>
<div class="hint-container warning">
<p class="hint-container-title">توجه</p>
<p>در اپ ادیتور، انتخاب صفحه اصلی الزامی است و باید حتماً یکی از صفحات به عنوان صفحه اصلی انتخاب شود.</p>
</div>
<div class="hint-container tip">
<p class="hint-container-title">ترفند</p>
<p>برای تعیین نوع صفحه به تنظیمات پروژه مراجعه کنید و در بخش مربوطه نوع صفحه را انتخاب کنید. همچنین در لیست صفحات، با کلیک روی دکمه سه نقطه مربوط به هر صفحه می توانید نوع آن صفحه را مشخص کنید</p>
</div>
<h3 id="لیست-صفحات" tabindex="-1"><a class="header-anchor" href="#لیست-صفحات" aria-hidden="true">#</a> لیست صفحات</h3>
<p>لیست صفحات در اپ ادیتور، فهرستی از تمام صفحات موجود در پروژه شما است. با کلیک بر روی هر صفحه، محتوای آن صفحه در شبیه‌ساز و بخش ویرایش جزئیات نمایش داده می‌شود.</p>
<div class="hint-container tip">
<p class="hint-container-title">ترفند</p>
<p>با دوبار کلیک روی هر صفحه در لیست صفحات یا با کلیک روی دکمه سه نقطه مربوط به هر صفحه، می‌توانید به گزینه تنظیمات صفحه دسترسی پیدا کنید و ویژگی‌های خاص صفحه را تغییر دهید.</p>
</div>
<p>همچنین می‌توانید صفحات را به دلخواه خود دسته‌بندی کنید. برای این کار می‌توانید پوشه‌هایی را برای صفحات ایجاد کنید و صفحات مورد نظر را به داخل آن‌ها منتقل کنید. این کار به شما کمک می‌کند تا صفحات پروژه‌تان را به صورت منظم مدیریت کنید و به راحتی بتوانید به صفحات مورد نظر دسترسی داشته باشید.</p>
<div class="hint-container warning">
<p class="hint-container-title">توجه</p>
<p>پوشه‌بندی صفحات در اپلیکیشن نهایی تأثیری ندارد، و صرفاً برای نظم دهی و مدیریت بهتر صفحات در محیط طراحی، این قابلیت اضافه شده است.</p>
</div>
<h3 id="تنظیمات-صفحه" tabindex="-1"><a class="header-anchor" href="#تنظیمات-صفحه" aria-hidden="true">#</a> تنظیمات صفحه</h3>
<p>در تنظیمات صفحه می توان برخی خصوصیات صفحه را تغییر داد یا قابلیت هایی را فعال کرد. برای نمایش فرم تنظیمات صفحه میتوانید در لیست صفحات روی دکمه سه نقطه مربوط به هر صفحه کلیک کنید و در منوی باز شده روی تنظیمات صفحه کلیک کنید.</p>
<div style="text-align: center">
<img :src="$withBase('/page-design/page-configs.png')" width="250" class="zoom">
</div>
<p>در نتظیمات صفحه موارد زیر را میتوانید تنظیم کنید:</p>
<ul>
<li>ویرایش نام صفحه</li>
<li><strong>تعیین راستچین یا چپ چین بودن صفحه:</strong> درصورتی که محتوای صفحه انگلیسی باشد میتوانید تیک راستچین بودن را بردارید تا نوشته ها و عناصر صفحه از چپ به راست نمایش داده شوند.</li>
<li><strong>قابل جستجو بودن:</strong> درصورتی که نمیخواهید صفحه در نتایج جستجو در اپ ظاهر شود یا محتوای آن قابل جستجو باشد این تیک را بردارید.</li>
<li><strong>تعیین قابلیت رفرش با کشیدن و رها کردن:</strong> با فعال سازی این گزینه موقعی که محتوای صفحه کشیده شود صفحه بروز رسانی می شود. برای این قابلیت باید حتما گروه اصلی در صفحه اسکرول پذیر باشد</li>
<li>انتخاب منوی صفحه</li>
<li>تعیین پولی بودن صفحه</li>
<li>تعیین قابلیت نمایش تبلیغ برای باز شدن صفحه</li>
<li>اجباری بودن لاگین برای دیدن صفحه</li>
<li>قابلیت چرخش صفحه</li>
<li>تنظیمات رنگ و روشنایی نوار وضعیت و نوار پیمایش</li>
<li>تعیین قابلیت نمایش تمام صفحه</li>
<li>تعیین نمایش یا عدم نمایش نوار وضعیت و نوار پیمایش</li>
<li>رمز گذاری روی صفحه</li>
<li>افزودن عملکرد برای <a href="/application-design/events">رویدادهای صفحه</a></li>
</ul>
</div></template>


