<template><div><h1 id="قالب‌های-آماده" tabindex="-1"><a class="header-anchor" href="#قالب‌های-آماده" aria-hidden="true">#</a> قالب‌های آماده</h1>
<div style="text-align: center">
<img :src="$withBase('/page-design/templates.jpg')" width="450" class="zoom">
</div>
<p>قالب ها به عنوان صفحات آماده، به کاربران اجازه می دهند تا با سرعت بیشتری به طراحی صفحات خود بپردازند. با انتخاب یک قالب، تمامی المان های آن صفحه به صورت اتوماتیک به همراه قالب انتخاب شده ایجاد می شوند و کاربر تنها نیاز دارد تا محتوای خود را در قالب قرار دهد.</p>
<p>همچنین، تنوع قالب ها از لحاظ طرح و استایل، به کاربران این امکان را می دهد که قالب مناسب با موضوع و برند خود را انتخاب کنند و در نتیجه نیاز به طراحی صفحه از ابتدا را نداشته باشند.</p>
<p>از جمله مزایای دیگر قالب ها، افزایش سرعت طراحی و در نتیجه صرفه جویی در زمان است. زیرا تمامی المان های مورد نیاز برای طراحی صفحه در قالب ها قرار دارند و نیازی به ایجاد آن ها از صفر نیست. به علاوه، استفاده از قالب ها، می تواند باعث بهبود کیفیت و ظاهر صفحات شود زیرا قالب های طراحی شده توسط حرفه ای ها و بهینه شده اند.</p>
<p>در اپ ادیور بعد از ایجاد صفحه می‌توانید از بین مجموعه ای از قالب ها یکی را که به طرح مورد نظر شما نزدیکتر است انتخاب کنید و ویرایش های لازم را اعمال کنید.</p>
</div></template>


